#### BuiltInFailures.RevisionFailures Members

---

|  |
| --- |
| BuiltInFailures RevisionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures RevisionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | RevisionSettingsDuplicateName | More than one Revisons have the same name %1!s!. |

# See Also

BuiltInFailures RevisionFailures Class

Autodesk.Revit.DB Namespace